music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at", "recordings") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 3], ["title", "Little cat songs "], ["year", 1994], ["created_at", "2019-09-05 21:27:52.005588"], ["updated_at", "2019-09-05 21:27:52.005588"], ["recordings", "live"]]