music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Lucy"], ["created_at", "2019-09-05 18:36:34.235995"], ["updated_at", "2019-09-05 18:36:34.235995"]]
---
    def create
      # debugger
      @band = Band.new(band_params)
      if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 10]]
---
    def destroy
      band = Band.find(params[:id])
      if band
        name = band.name
        band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
      # debugger
      @band = Band.find(params[:id])

SELECT "bands".* FROM "bands"
---
    def index
      @band = Band.all